<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Munki recipe for RingCentral Phone (RingCentral for Mac.app)</string>
    <key>Comment</key>
	<string>https://support.ringcentral.com/article/7244.html</string>
    <key>Identifier</key>
    <string>com.github.bradclare.munki.ringcentralphone</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/RingCentral</string>
        <key>NAME</key>
        <string>RingCentral Phone</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>The RingCentral Phone is an easy-to-use app, and a comprehensive communications hub with an all-inclusive phone, fax, business SMS, and conferencing for your desktop. It provides an intuitive interface that optimizes the user experience and increases productivity.</string>
            <key>display_name</key>
            <string>RingCentral Phone</string>
            <key>minimum_os_version</key>
            <string>10.13</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.bradclare.download.ringcentralphone</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
