<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Munki recipe for RingCentral</string>
    <key>Comment</key>
    <string>https://support.ringcentral.com/article/Using-Latest-RingCentral-App.html</string>
    <key>Identifier</key>
    <string>com.github.bradclare.munki.ringcentral</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/RingCentral</string>
        <key>NAME</key>
        <string>RingCentral</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>RingCentral.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Everything you need in one beautiful app; Team messaging, video meetings, and a business phone-reimagined so you can do more from anywhere.</string>
            <key>display_name</key>
            <string>RingCentral</string>
            <key>minimum_os_version</key>
            <string>10.10.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.bradclare.download.ringcentral</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
