<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads FileMaker 13 disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.bradclare.munki.filemakerpro13</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/FileMaker</string>
        <key>NAME</key>
        <string>FileMakerPro13</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Streamline your business with the FileMaker Platform. Easily create custom solutions for iPad, iPhone, Windows, Mac and the web that meet the unique needs of your organization. Manage customer data, track assets, organize projects, run reports, and more. With the FileMaker Platform you'll be able to improve workflow, save money, and increase overall efficiency.</string>
            <key>display_name</key>
            <string>FileMaker Pro 13</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.bradclare.download.filemakerpro13</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>