<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SpeechControl.</string>
	<key>Identifier</key>
	<string>com.github.bradclare.download.SpeechControl</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.dictation.philips.com/no_cache/au/popups/software-popup/?jumpurl=fileadmin%2FSupport%2Fsoftware%2Fspeechcontrol%2Fspeechcontrol4mac_swm_3.3.08.dmg&amp;juSecure=1&amp;locationData=66%3Att_content%3A132&amp;juHash=52403b800a09e32d6966c9d9f8c37a9a141d2af4</string>
		<key>NAME</key>
		<string>SpeechControl</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
