<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Daylite disk image and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.bradclare.munki.daylite</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Daylite</string>
		<key>NAME</key>
		<string>Daylite</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Daylite.app</string>
				<string>Mail.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Daylite keeps everything related to your business in one place, so you and your team can share information wherever they are by Mac, iPhone, and iPad. Your contacts, schedule, tasks, projects, sales opportunities, emails, and notes are all there, making it easy to find what you are looking for in seconds.</string>
			<key>display_name</key>
			<string>Daylite</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh

# Daylite postinstall
# Installs Daylite Mail Assistant

dmaPkg="/Applications/Daylite.app/Contents/Resources/Packages/InstallDMA.pkg"

if [ ! -f "${dmaPkg}" ]
then
	/bin/echo "ERROR: Daylite Mail Assistant package not found."
	exit 1
fi

/usr/sbin/installer -verbose -pkg "${dmaPkg}" -target /</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.bradclare.download.daylite</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/unzip</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>s
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%dmg_path%</string>
					<string>%RECIPE_CACHE_DIR%/unzip</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
