<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for AccountEdge Pro (Canada).</string>
    <key>Identifier</key>
    <string>com.github.bradclare.download.accountedgeprocanada</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AccountEdgeProCanada</string>
        <key>DOWNLOAD_URL</key>
        <string>http://get.acclivitysoftware.com/downloads/AccountEdge_Pro_Canada_Mac.dmg.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>